Repository: diginikkari/wtforms
Catalog: wtforms/locale/*/LC_MESSAGES/wtforms.po
Languages: fi

source: Invalid field name '%s'.
fi: Virheellinen kentän nimi '%s'.

source: Field must be equal to %(other_name)s.
fi: Kenttä on oltava vastaava kuin %(other_name)s.

source: Field must be at least %(min)d character long.
fi: Kenttä on oltava vähintään %(min)d merkin pituinen.

source: Field cannot be longer than %(max)d character.
fi: Kenttä ei voi olla pidempi kuin %(max)d merkki.

source: Field must be between %(min)d and %(max)d characters long.
fi: Kentän pituus voi olla %(min)d - %(max)d merkkiä.

source: Number must be at least %(min)s.
fi: Numero on oltava vähintään %(min)s.

source: Number must be at most %(max)s.
fi: Numero voi olla korkeintaan %(max)s.

source: Number must be between %(min)s and %(max)s.
fi: Numeron on oltava välillä %(min)s ja %(max)s.

source: This field is required.
fi: Pakollinen kenttä.

source: Invalid input.
fi: Virheellinen syöttötieto.

source: Invalid email address.
fi: Virheellinen sähköpostiosoite.

source: Invalid IP address.
fi: Kelvoton IP-osoite.

source: Invalid Mac address.
fi: Virheellinen MAC-osoite.

source: Invalid URL.
fi: Epäkelpo URL.

source: Invalid UUID.
fi: Virheellinen UUID.

source: Invalid value, must be one of: %(values)s.
fi: Virheellinen arvo, on oltava yksi näistä: %(values)s.

source: Invalid value, can't be any of: %(values)s.
fi: Virheellinen arvo, ei voi olla mikään näistä: %(values)s.

source: Invalid CSRF Token
fi: Virheellinen CSRF-token

source: CSRF token missing
fi: CSRF-token puuttuu

source: CSRF failed
fi: CSRF epäonnistui

source: CSRF token expired
fi: CSRF-token vanhentunut

source: Not a valid choice
fi: Ei kelvollinen valinta

source: Not a valid list
fi: Ei kelvollinen lista

source: Not a valid integer list
fi: Ei kelvollinen kokonaisluku lista

source: Please input a date/time value
fi: Ole hyvä, anna päivämäärä/aika

source: Invalid date/time input
fi: Virheellinen päivämäärä/aika

source: Already exists.
fi: On jo olemassa.

source: Invalid Choice: could not coerce
fi: Virheellinen valinta: pakotus ei ole mahdollinen

source: Invalid choice(s): one or more data inputs could not be coerced
fi: Virheellinen valinta: yhtä tai useampaa syötteistä ei voida pakottaa

source: '%(value)s' is not a valid choice for this field
fi: '%(value)s' ei ole sallittu vaihtoehto

source: Not a valid integer value
fi: Epäkelpo kokonaisluku

source: Not a valid decimal value
fi: Ei kelvollinen desimaalin arvo

source: Not a valid float value
fi: Ei kelvollinen float arvo

source: Not a valid datetime value
fi: Ei kelvollinen päivämäärä arvo

source: Not a valid date value
fi: Ei kelvollinen päivämäärä arvo
